{
  "products": [
    {
      "id": 10001,
      "name": "Basics To Advanced In React",
      "overview": "Master React from fundamentals to advanced concepts in this comprehensive guide for aspiring developers.",
      "long_description": "Dive into the immersive world of React with 'Basics To Advanced In React.' This comprehensive guide is crafted to cater to both beginners and seasoned developers, providing a meticulous exploration of React's fundamental principles and advanced capabilities. From setting up your development environment to mastering state management and routing, each chapter is designed to build a strong foundation and elevate your expertise. With hands-on examples and real-world applications, this book ensures that you not only grasp theoretical concepts but also gain practical insights into building dynamic and responsive user interfaces. Whether you're starting your journey in web development or seeking to enhance your skills, this book serves as your reliable companion. Join us on this learning adventure and unlock the full potential of React, emerging as a proficient developer ready to tackle modern web development challenges.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10001.avif",
      "rating": 5,
      "in_stock": true,
      "size": 5,
      "best_seller": true
    },
    {
      "id": 10002,
      "name": "Django Framework for Beginners",
      "overview": "Unlock Django's power with this beginner-friendly guide to web development using the Django framework.",
      "long_description": "Embark on your web development journey with 'Django Framework for Beginners.' This book serves as your gateway to the powerful and efficient Django framework, designed to simplify the complexities of building robust web applications. Ideal for those taking their first steps into the world of web development, this guide provides a hands-on and beginner-friendly approach to Django. From understanding the MVC architecture to creating dynamic web pages and handling user authentication, each chapter guides you through essential concepts with practical examples. As you progress, you'll gain proficiency in database integration, URL routing, and template rendering. Whether you're a programming novice or transitioning to Django from another framework, this book ensures a smooth learning curve, empowering you to create web applications with confidence and efficiency.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1580894894513-541e068a3e2b?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10002.avif",
      "rating": 5,
      "in_stock": true,
      "size": 2,
      "best_seller": false
    },
    {
      "id": 10003,
      "name": "The Future of Design Systems",
      "overview": "Explore the evolution of design systems in 'The Future of Design Systems.' Discover their impact and significance in shaping modern digital experiences.",
      "long_description": "Embark on a visionary journey with 'The Future of Design Systems,' a comprehensive exploration of the evolution and profound impact of design systems in shaping the digital landscape. This book delves into the core principles, methodologies, and emerging trends that define the future trajectory of design systems. From enhancing collaboration among interdisciplinary teams to ensuring consistency across diverse platforms, each chapter unfolds the transformative potential of design systems. Gain insights into best practices, case studies, and expert perspectives, equipping you with the knowledge to navigate the dynamic intersection of design and technology. Whether you're a seasoned designer, developer, or a curious enthusiast, this book provides a compelling narrative on the pivotal role design systems play in shaping the future of user-centric and visually compelling digital experiences.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1523726491678-bf852e717f6a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10003.avif",
      "rating": 3,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10004,
      "name": "The Complete Guide to Backend Development",
      "overview": "Master backend development with our comprehensive guide, covering essential concepts, hands-on projects, and best practices, empowering you to build robust and scalable server-side applications with confidence.",
      "long_description": "Delve into the intricacies of mastering backend development with our comprehensive guide. This immersive course covers essential concepts, practical hands-on projects, and industry best practices. By the end of this journey, you'll not only understand the core principles but also be equipped to build robust and scalable server-side applications with confidence and precision.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1595617795501-9661aafda72a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10004.avif",
      "rating": 5,
      "in_stock": true,
      "size": 7,
      "best_seller": true
    },
    {
      "id": 10005,
      "name": "Build a Blockchain from Scratch in Go",
      "overview": "Unlock the secrets of blockchain creation with 'Build a Blockchain from Scratch in Go.' Dive into the fundamentals and craft your own blockchain network from the ground up.",
      "long_description": "Dive into the fascinating world of blockchain technology with 'Build a Blockchain from Scratch in Go.' This comprehensive guide takes you on a step-by-step journey, unraveling the complexities of blockchain development using the Go programming language. From understanding the foundational concepts to hands-on implementation, this book empowers both beginners and experienced developers to grasp the intricacies of creating a fully functional blockchain. Explore the core principles of decentralized ledgers, consensus algorithms, and smart contracts, gaining practical insights through real-world examples. Whether you're a curious enthusiast or a developer eager to delve into blockchain development, this book equips you with the knowledge and skills to embark on your journey of building a blockchain from the ground up in Go.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1639322537228-f710d846310a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10005.avif",
      "rating": 3,
      "in_stock": true,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10006,
      "name": "Frontend Fastlane Plan With Projects",
      "overview": "Dive into frontend development with our Fastlane Plan—curated projects to elevate skills and unleash creativity, crafting captivating user interfaces.",
      "long_description": "Immerse yourself in the dynamic realm of frontend development with our Fastlane Plan. This meticulously curated program introduces you to real-world projects, meticulously designed to elevate your skills. Unleash your creativity and craft visually stunning user interfaces that not only captivate but also engage users on a profound level.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1522542550221-31fd19575a2d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10006.avif",
      "rating": 5,
      "in_stock": true,
      "size": 10,
      "best_seller": false
    },
    {
      "id": 10007,
      "name": "Master the Code Review",
      "overview": "Enhance your coding skills with 'Master the Code Review' for effective collaboration and continuous improvement.",
      "long_description": "Dive into the art and science of code reviews with 'Master the Code Review.' This comprehensive guide is designed to elevate your coding skills and foster a culture of collaboration within your development team. Explore the importance of code reviews in producing high-quality software, understand best practices for providing and receiving constructive feedback, and learn strategies for efficient collaboration throughout the review process. Whether you're a seasoned developer or new to the world of code reviews, this book equips you with valuable insights and practical techniques to master the art of code review, resulting in improved code quality, increased team efficiency, and a more robust development workflow.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1621839673705-6617adf9e890?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10007.avif",
      "rating": 5,
      "in_stock": true,
      "size": 2,
      "best_seller": false
    },
    {
      "id": 10008,
      "name": "JavaScript Basics To Advance With Shubham",
      "overview": "Embark on a transformative JavaScript journey with Shubham's guidance, gaining hands-on immersion, confidence, and the ability to tackle web development challenges effortlessly.",
      "long_description": "Embark on a transformative learning experience as you traverse the fundamentals and advanced techniques of JavaScript with Shubham as your guide. This dynamic course provides a hands-on, immersive experience, empowering you to not just write code but to understand the nuances and intricacies of JavaScript. By the end of this journey, you'll be well-versed, confident, and ready to tackle complex web development challenges with ease.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1613490900233-141c5560d75d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10008.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10009,
      "name": "Python Deep Dive With Projects",
      "overview": "Dive into Python's depths, mastering key concepts and applying skills with 'Python Deep Dive.'",
      "long_description": "Embark on a comprehensive journey through the intricacies of Python programming with 'Python Deep Dive With Projects.' This book is crafted for both beginners seeking a solid foundation and experienced developers aiming to refine their Python skills. Delve into the language's core concepts, from basic syntax to advanced topics, and reinforce your learning through hands-on projects designed to challenge and deepen your understanding. Whether you're aspiring to build web applications, automate tasks, or dive into data science, this book provides the tools and knowledge you need. Gain practical insights, tackle real-world projects, and emerge with a profound mastery of Python's versatility and power.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1624953587687-daf255b6b80a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10009.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10010,
      "name": "Mastering Software Technique",
      "overview": "Master software techniques with this comprehensive guide to enhance your programming skills and craftsmanship.",
      "long_description": "Embark on a transformative journey into the world of software development with 'Mastering Software Technique.' This book is designed for aspiring and seasoned developers alike, offering a deep dive into the art and science of crafting high-quality, efficient, and maintainable software. Explore a spectrum of advanced techniques, coding practices, and design principles that elevate your programming skills. From code organization to performance optimization, this guide covers it all, providing practical insights and real-world examples. Whether you're a novice looking to build a strong foundation or an experienced developer aiming to refine your craft, 'Mastering Software Technique' equips you with the knowledge and tools to write software that stands the test of time.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1623479322729-28b25c16b011?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10010.avif",
      "rating": 4,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10011,
      "name": "Web Development Foundation",
      "overview": "Embark on a transformative journey to build a solid foundation in web development essentials with this comprehensive guide. Ideal for learners and enthusiasts seeking to master the intricacies of modern web development.",
      "long_description": "Dive into the core principles of web development with 'Web Development Foundation.' This book serves as your indispensable companion on the journey to mastering the fundamental concepts that underpin modern web applications. From HTML and CSS to client-side scripting and server-side technologies, each chapter provides a hands-on approach, guiding you through practical exercises and real-world examples. Whether you're a beginner aiming to grasp the basics or an aspiring developer looking to solidify your understanding, this book offers a structured and engaging learning experience. Explore the intricacies of web development, gain practical skills, and set the stage for your future success in the dynamic world of building for the web.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1507721999472-8ed4421c4af2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10011.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    },
    {
      "id": 10012,
      "name": "Mastering Git and GitHub - A Practical Guide",
      "overview": "Master Git and GitHub with this practical guide for efficient version control and collaboration.",
      "long_description": "Dive deep into the world of version control with 'Mastering Git and GitHub - A Practical Guide.' This comprehensive book equips you with the skills needed to harness the power of Git for efficient tracking, collaboration, and management of your software projects. From understanding the basics of Git commands to leveraging the collaborative features of GitHub, each chapter provides hands-on exercises and real-world examples. Whether you're a solo developer or part of a team, this book guides you through best practices, workflows, and advanced techniques to streamline your development process. Uncover the secrets of branching, merging, resolving conflicts, and more, empowering you to become a proficient Git user and a valuable contributor to collaborative projects. Elevate your version control skills with this indispensable resource.",
      "price": 9,
      "poster": "https://images.unsplash.com/photo-1618401471353-b98afee0b2eb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10012.avif",
      "rating": 5,
      "in_stock": true,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 10013,
      "name": "Everything About React v16",
      "overview": "Comprehensive guide to React v16 – from fundamentals to advanced concepts for building dynamic user interfaces.",
      "long_description": "Embark on a comprehensive journey through 'Everything About React v16,' a definitive guide designed for both beginners and experienced developers. This book meticulously covers the fundamentals of React, providing a solid foundation for building dynamic and interactive user interfaces. As you progress, delve into advanced concepts, including state management, component lifecycle, hooks, and React Router. The hands-on approach ensures practical learning through examples and projects, empowering you to apply your knowledge effectively. Stay up-to-date with the latest features introduced in React version 16, and gain insights into best practices for creating scalable and maintainable applications. Whether you're starting your React journey or aiming to deepen your expertise, this book is your companion for mastering React v16 and crafting engaging user experiences.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1633356122102-3fe601e05bd2?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10013.avif",
      "rating": 4,
      "in_stock": false,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10014,
      "name": "Diving Deep With Python 2.7",
      "overview": "Explore Python 2.7 in-depth – from basics to advanced techniques for versatile and efficient programming.",
      "long_description": "Dive into the intricacies of Python 2.7 with 'Diving Deep With Python 2.7,' a comprehensive guide tailored for developers seeking mastery in Python programming. This book carefully navigates through the fundamental concepts, syntax, and features of Python 2.7, offering a solid foundation for building robust applications. As you progress, delve into advanced techniques, including data manipulation, object-oriented programming, and leveraging Python's extensive standard library. The hands-on examples and projects ensure a practical understanding of the language, empowering you to tackle real-world challenges with confidence. Whether you're a beginner looking to grasp the basics or an experienced developer aiming to enhance your Python skills, this book is your go-to resource for mastering Python 2.7 and becoming a proficient programmer.",
      "price": 19,
      "poster": "https://images.unsplash.com/photo-1515879218367-8466d910aaa4?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10014.avif",
      "rating": 4,
      "in_stock": false,
      "size": 3,
      "best_seller": false
    },
    {
      "id": 10015,
      "name": "Kickstart Your UI Design Career",
      "overview": "Accelerate your UI design career with essential insights and practical strategies for impactful, user-centric designs.",
      "long_description": "Embark on a transformative journey to 'Kickstart Your UI Design Career,' a comprehensive guide tailored for aspiring and seasoned UI designers alike. This book is your gateway to the dynamic and ever-evolving field of UI design, offering a curated blend of essential insights, hands-on techniques, and strategic approaches. Whether you're a novice looking to enter the world of UI design or a seasoned professional aiming to stay ahead of industry trends, this resource provides a holistic exploration of user interface principles, design tools, and best practices. Dive into real-world case studies, learn to harness design thinking, and master the art of creating interfaces that not only captivate users but also elevate the overall user experience. With a focus on practicality and innovation, 'Kickstart Your UI Design Career' equips you with the skills and knowledge needed to thrive in the competitive landscape of UI design, empowering you to shape the future of digital interactions.",
      "price": 9,
      "poster": "https://images.unsplash.com/photo-1587440871875-191322ee64b0?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10015.avif",
      "rating": 2,
      "in_stock": false,
      "size": 1,
      "best_seller": false
    }
  ],
  "featured_products": [
    {
      "id": 10004,
      "name": "The Complete Guide to Backend Development",
      "overview": "Master backend development with our comprehensive guide, covering essential concepts, hands-on projects, and best practices, empowering you to build robust and scalable server-side applications with confidence.",
      "long_description": "Delve into the intricacies of mastering backend development with our comprehensive guide. This immersive course covers essential concepts, practical hands-on projects, and industry best practices. By the end of this journey, you'll not only understand the core principles but also be equipped to build robust and scalable server-side applications with confidence and precision.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1595617795501-9661aafda72a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10004.avif",
      "rating": 5,
      "in_stock": true,
      "size": 7,
      "best_seller": true
    },
    {
      "id": 10006,
      "name": "Frontend Fastlane Plan With Projects",
      "overview": "Dive into frontend development with our Fastlane Plan—curated projects to elevate skills and unleash creativity, crafting captivating user interfaces.",
      "long_description": "Immerse yourself in the dynamic realm of frontend development with our Fastlane Plan. This meticulously curated program introduces you to real-world projects, meticulously designed to elevate your skills. Unleash your creativity and craft visually stunning user interfaces that not only captivate but also engage users on a profound level.",
      "price": 99,
      "poster": "https://images.unsplash.com/photo-1522542550221-31fd19575a2d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10006.avif",
      "rating": 5,
      "in_stock": true,
      "size": 10,
      "best_seller": false
    },
    {
      "id": 10008,
      "name": "JavaScript Basics To Advance With Shubham",
      "overview": "Embark on a transformative JavaScript journey with Shubham's guidance, gaining hands-on immersion, confidence, and the ability to tackle web development challenges effortlessly.",
      "long_description": "Embark on a transformative learning experience as you traverse the fundamentals and advanced techniques of JavaScript with Shubham as your guide. This dynamic course provides a hands-on, immersive experience, empowering you to not just write code but to understand the nuances and intricacies of JavaScript. By the end of this journey, you'll be well-versed, confident, and ready to tackle complex web development challenges with ease.",
      "price": 29,
      "poster": "https://images.unsplash.com/photo-1613490900233-141c5560d75d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
      "image_local": "/assets/images/10008.avif",
      "rating": 5,
      "in_stock": true,
      "size": 3,
      "best_seller": true
    }
  ],
  "orders": [
    {
      "cartList": [
        {
          "id": 10001,
          "name": "Basics To Advanced In React",
          "overview": "Master React from fundamentals to advanced concepts in this comprehensive guide for aspiring developers.",
          "long_description": "Dive into the immersive world of React with 'Basics To Advanced In React.' This comprehensive guide is crafted to cater to both beginners and seasoned developers, providing a meticulous exploration of React's fundamental principles and advanced capabilities. From setting up your development environment to mastering state management and routing, each chapter is designed to build a strong foundation and elevate your expertise. With hands-on examples and real-world applications, this book ensures that you not only grasp theoretical concepts but also gain practical insights into building dynamic and responsive user interfaces. Whether you're starting your journey in web development or seeking to enhance your skills, this book serves as your reliable companion. Join us on this learning adventure and unlock the full potential of React, emerging as a proficient developer ready to tackle modern web development challenges.",
          "price": 29,
          "poster": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
          "image_local": "/assets/images/10001.avif",
          "rating": 5,
          "in_stock": true,
          "size": 5,
          "best_seller": true
        },
        {
          "id": 10002,
          "name": "Django Framework for Beginners",
          "overview": "Unlock Django's power with this beginner-friendly guide to web development using the Django framework.",
          "long_description": "Embark on your web development journey with 'Django Framework for Beginners.' This book serves as your gateway to the powerful and efficient Django framework, designed to simplify the complexities of building robust web applications. Ideal for those taking their first steps into the world of web development, this guide provides a hands-on and beginner-friendly approach to Django. From understanding the MVC architecture to creating dynamic web pages and handling user authentication, each chapter guides you through essential concepts with practical examples. As you progress, you'll gain proficiency in database integration, URL routing, and template rendering. Whether you're a programming novice or transitioning to Django from another framework, this book ensures a smooth learning curve, empowering you to create web applications with confidence and efficiency.",
          "price": 19,
          "poster": "https://images.unsplash.com/photo-1580894894513-541e068a3e2b?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=650&q=40",
          "image_local": "/assets/images/10002.avif",
          "rating": 5,
          "in_stock": true,
          "size": 2,
          "best_seller": false
        }
      ],
      "amount_paid": 48,
      "quantity": 2,
      "user": {
        "name": "Hakuna",
        "email": "hakuna@example.com",
        "id": 1
      },
      "id": 1
    }
  ],
  "users": [
    {
      "email": "hakuna@example.com",
      "password": "$2a$10$tfBRG3s1wMCS1bxiSB2mC.riLVyu2KgrrEQctf7hff9dDsLKAateu",
      "name": "Hakuna",
      "id": 1
    }
  ]
}